{
    "bae": ["A term of endearment, usually for a romantic partner.", "I can't wait to see my bae this weekend."],
    "basic": ["Conforming to mainstream culture, lacking individuality or originality.", "Her taste in music is so basic; she only listens to what's popular."],
    "bet": ["An expression of agreement or affirmation.", "You'll be there at 8? Bet."],
    "bruh": ["A casual term used to address a male friend.", "Bruh, did you see that movie?"],
    "chill": ["To relax or calm down.", "Just chill, everything will be okay."],
    "clap back": ["To respond sharply or with a comeback, often in a confrontational manner.", "She really clapped back at him during the argument."],
    "cray cray": ["Extremely crazy or insane.", "The party last night was cray cray; it went on until sunrise."],
    "dope": ["Excellent or cool.", "That new song is dope; I can't stop listening to it."],
    "extra": ["Over the top or excessive.", "Why are you being so extra about your outfit? It's just a casual dinner."],
    "fam": ["Short for 'family,' often used to refer to close friends or relatives.", "I'm hanging out with the fam this weekend."],
    "fleek": ["On point or perfectly styled.", "Her eyebrows are on fleek today."],
    "fomo": ["Fear of missing out, the feeling of anxiety or insecurity caused by the belief that others are having fun without you.", "I didn't go to the party because of my fomo."],
    "ghosting": ["Ending a relationship abruptly by cutting off all communication without explanation.", "He totally ghosted me after our third date."],
    "goals": ["Something desirable or aspirational, often used to describe a perfect relationship or lifestyle.", "Look at them; they're relationship goals."],
    "grind": ["To work hard and persistently towards a goal.", "I'm on the grind to get that promotion."],
    "lit": ["Something that is amazing or exciting.", "The concert last night was lit; the crowd was wild."],
    "low key": ["Quietly or secretly.", "I'm low key excited for the weekend."],
    "mood": ["An expression used to convey one's current emotional state or feelings.", "This rainy weather is such a mood."],
    "no cap": ["No lies or exaggeration, speaking truthfully.", "I'm serious, no cap."],
    "on fleek": ["Perfectly styled or executed.", "Her outfit is on fleek today."],
    "shade": ["Disrespectful or insulting behavior, often subtle or indirect.", "She threw so much shade at him during the meeting."],
    "savage": ["Fearless and unapologetic behavior.", "Did you see how she roasted him? She's savage."],
    "squad": ["A close group of friends.", "I'm going out with the squad tonight."],
    "stan": ["An extremely devoted fan of a celebrity or public figure.", "She's a stan of Beyoncé; she knows all her songs by heart."],
    "swerve": ["To abruptly change direction or avoid something.", "I had to swerve to avoid hitting that pothole."],
    "tea": ["Gossip or juicy information.", "Spill the tea; what did you hear about them?"],
    "thirsty": ["Desperate or eager, often used to describe someone seeking attention or validation.", "Stop commenting on her posts all the time; you're so thirsty."],
    "vibe": ["The atmosphere or feeling of a place, situation, or person.", "The vibe at the party was amazing."],
    "woke": ["Aware of and actively attentive to important facts and issues, especially issues of racial and social justice.", "She's so woke; she's always advocating for equality."],
    "yeet": ["An exclamation of excitement, approval, or triumph.", "He threw the ball and yelled 'yeet' as it flew through the air."],
    "yolo": ["You only live once, used to justify impulsive or risky behavior.", "I'm going skydiving tomorrow; yolo!"], "litigate": ["To engage in a legal proceeding, typically in court.", "The two parties decided to litigate their dispute rather than settle it out of court."],
    "snatched": ["Looking exceptionally good or well put together.", "Her outfit is snatched; she looks amazing."],
    "clout": ["Influence or power, especially in the context of social media.", "She has a lot of clout on Instagram."],
    "hustle": ["To work hard, typically in multiple endeavors or side projects.", "She's always hustling, trying to make extra money."],
    "thicc": ["Describing someone with a curvaceous or voluptuous body, especially in a desirable way.", "She's got a thicc figure."],
    "sus": ["Suspicious or questionable.", "His story sounds sus; I don't believe him."],
    "ratchet": ["Low quality or trashy.", "That party was ratchet; I'm never going back."],
    "lit af": ["Extremely lit or exciting.", "The concert was lit af; it was the best show I've ever been to."],
    "suspect": ["Questionable or suspicious.", "His behavior has been suspect lately."],
    "dank": ["High-quality or excellent, often used to describe food or marijuana.", "That pizza was dank; I want another slice."],
    "clique": ["A small, exclusive group of people with shared interests or characteristics.", "She's part of the popular clique at school."],
    "deadass": ["A term used to emphasize the truthfulness or seriousness of a statement.", "I'm deadass tired of dealing with drama."],
    "dope": ["Excellent or cool.", "That skateboard trick was so dope."],
    "flex": ["To show off or boast, often about one's possessions or achievements.", "He's always flexing his new clothes on Instagram."],
    "finesse": ["To handle a situation smoothly and skillfully.", "She finessed her way out of a speeding ticket."],
    "fuego": ["Excellent or outstanding.", "That party last night was fuego."],
    "gang": ["A close-knit group of friends or associates.", "She's part of my gang; we've been friends since childhood."],
    "ghost": ["To suddenly and completely cut off communication with someone.", "He ghosted me after our second date."],
    "peep": ["To look at or observe closely.", "Did you peep that new car she got?"],
    "rekt": ["Completely and decisively defeated or humiliated.", "He got rekt in the video game tournament."],
    "savage": ["Fearless and unapologetic behavior.", "She made a savage comeback during the argument."],
    "shade": ["Disrespectful or insulting behavior.", "She threw shade at him for wearing the same outfit."],
    "ship": ["To support or endorse a romantic pairing between two people.", "I totally ship them; they would make a great couple."],
    "slay": ["To perform exceptionally well or to look extremely fashionable.", "She slayed her performance on stage."],
    "spill the tea": ["To share gossip or secrets.", "Girl, spill the tea about what happened last night."],
    "stan": ["An overly enthusiastic fan of a celebrity or public figure.", "She's a stan of that band; she knows all their songs."],
    "thirsty": ["Desperate or overly eager, especially for attention or validation.", "She's so thirsty for likes on social media."],
    "vibin'": ["To be in a relaxed and enjoyable state.", "We were just vibin' at the beach all day."],
    "wig": ["A reaction of shock or amazement.", "When she hit that high note, my wig was snatched."],
    "yeet": ["An exclamation of excitement, approval, or triumph.", "He yeeted the ball across the room."],
    "zoned out": ["To become unaware of one's surroundings, often due to daydreaming or deep concentration.", "I totally zoned out during the lecture."], 
    "backburner friend":  ["A person who is kept as a friend but is not a priority in one's life. This term can apply to both platonic and romantic relationships, though it is commonly used in the context of romantic relationships. In a platonic context, a backburner friend may be someone with whom you have a friendship, but you don't actively spend time with them or prioritize them in your social life. Essentially, they are kept 'on the backburner' as a friend, but they are not at the forefront of your social circle or activities."],
    "sus": ["Suspicious or questionable.", "His behavior seems sus; I don't trust him."],
  "glow-up": ["A transformation, especially a dramatic one, in a person's appearance or lifestyle for the better.", "She had a glow-up after high school; she's so confident now."],
  "stan": ["To be an overly enthusiastic fan of someone or something.", "I stan this new artist; their music is amazing."],
  "simp": ["A person who is overly submissive or attentive to someone else, often to gain their affection or approval.", "He's such a simp for her; he'll do anything she asks."],
  "cap": ["To lie or exaggerate.", "Why are you always capping about your achievements?"],
  "vibing": ["Being in a relaxed and enjoyable state.", "We were just vibing at the beach all day."],
  "cancel culture": ["A modern form of ostracism in which someone is publicly shunned or boycotted for behavior deemed unacceptable.", "The celebrity faced cancel culture after his controversial remarks."],
  "shade": ["Disrespectful or insulting behavior, often subtle or indirect.", "She threw shade at him for wearing the same outfit."],
  "snatched": ["Looking exceptionally good or well put together.", "Her outfit is snatched; she looks amazing."],
  "cringy": ["Causing feelings of embarrassment or awkwardness.", "His jokes are so cringy; I can't listen to them."],
  "boomer": ["A derogatory term used to describe someone from an older generation, typically baby boomers, who is perceived as out of touch with modern culture.", "My dad doesn't understand memes; he's such a boomer."],
  "goat": ["An acronym for 'greatest of all time,' used to describe someone or something as the best.", "Michael Jordan is the goat of basketball."],
  "simping": ["Acting overly submissive or attentive towards someone else, often to gain their affection or approval.", "He's been simping over her for weeks; it's embarrassing."],
  "tiktok": ["A social media platform for sharing short videos, often featuring lip-syncing, dancing, or comedy.", "She went viral on TikTok with her dance video."],
  "thirst trap": ["A social media post intended to attract attention or compliments, often by showing off one's physical attractiveness.", "She posted a thirst trap on Instagram to get more likes."],
  "FOMO": ["Fear of missing out, the feeling of anxiety or insecurity caused by the belief that others are having fun without you.", "I didn't go to the party because of my FOMO."],
  "ghosting": ["Ending a relationship abruptly by cutting off all communication without explanation.", "He totally ghosted me after our third date."],
  "zaddy": ["A slang term for an attractive or stylish man who is considered desirable.", "Look at him; he's such a zaddy."],
  "thicc": ["Describing someone with a curvaceous or voluptuous body, often in a desirable way.", "She's looking thicc in that dress."],
  "highkey": ["Openly or obviously.", "Highkey, I'm craving pizza right now."],
  "lowkey": ["Quietly or secretly.", "I'm lowkey excited for the weekend."],
  "bop": ["A catchy and enjoyable song.", "That new track is a bop; I can't stop listening to it."],
  "hustle": ["To work hard, typically in multiple endeavors or side projects.", "She's always hustling, trying to make extra money."],
  "deadass": ["A term used to emphasize the truthfulness or seriousness of a statement.", "I'm deadass tired of dealing with drama."],
  "salty": ["Upset or bitter about something"],
  "shook": ["Deeply shocked or surprised"],
  "shookneth": ["An intensified version of 'shook'"],
  "bussin": ["Extremely delicious or enjoyable"],
  "bussin' down": ["Dancing in a stylish or energetic way"],
  "shoyu": ["Soy sauce"],
  "gomu gomu": ["Cuddling or being physically affectionate"],
  "petty": ["Small-minded or inconsequential"],
  "extra AF": ["Extraordinarily over-the-top"],
  "adulting hard": ["Struggling with the responsibilities of being an adult"],
  "IYKYK": ["If you know, you know"],
  "lowkey fire": ["Secretly or surprisingly good"],
  "woke bae": ["A partner who is socially conscious and aware of important issues"],
  "sheesh": ["Expressing surprise or disbelief"],
  "feels": ["Emotions or vibes"],
  "bouta": ["About to"],
  "fam bam": ["Close friends and family"],
  "fleeky": ["Looking sharp or stylish"],
  "famzoned": ["Relegated to friend status"],
  "Netflix and chill": ["Relaxing at home and watching Netflix"],
  "ship it": ["Supporting a romantic relationship between two people"],
  "salty tears": ["Tears shed out of sadness or frustration"],
  "low-key obsessed": ["Secretly very interested in something"],
  "adulting wins": ["Successfully completing adult tasks"],
  "cheat code": ["An easy way to achieve something"],
  "glow down": ["The opposite of a glow-up; a decline in appearance"],
  "big mood": ["A situation that perfectly reflects one's current mood"],
  "periodt": ["An emphatic way to agree with something"],
  "shookt": ["A misspelling of 'shook,' used for comedic effect"],
  "finna": ["Fixing to"],
  "woke AF": ["Extremely socially conscious and aware"],
  "Netflix and chill (but actually chill)": ["Relaxing at home and watching Netflix without any romantic intentions"],
  "doe-eyed": ["Having large, innocent-looking eyes"],
  "rizz": ["Having charisma or charm, especially when it comes to attracting romantic partners"]
}
  
  
  